
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 5 to add, 0 to change, 3 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.POSTGRES-DATABASE
  * azurerm_key_vault_secret.POSTGRES-HOST
  * azurerm_key_vault_secret.POSTGRES-PASS
  * azurerm_key_vault_secret.POSTGRES-PORT
  * azurerm_key_vault_secret.POSTGRES-USER
* Delete
  * azurerm_key_vault_secret.POSTGRES-HOST-V15
  * azurerm_key_vault_secret.POSTGRES-PASS-V15
  * azurerm_key_vault_secret.POSTGRES-USER-V15


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES-DATABASE will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-DATABASE" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/jps-shared-aat/providers/Microsoft.KeyVault/vaults/jps-aat"
      + name                    = "judicial-payment-service-POSTGRES-DATABASE"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES-HOST will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-HOST" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/jps-shared-aat/providers/Microsoft.KeyVault/vaults/jps-aat"
      + name                    = "judicial-payment-service-POSTGRES-HOST"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES-HOST-V15 will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES-HOST-V15 is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES-HOST-V15" {
      - id                      = "https://jps-aat.vault.azure.net/secrets/judicial-payment-service-POSTGRES-HOST-V15/2e80a97aa89f409b8084fc24d5a3da7e" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/jps-shared-aat/providers/Microsoft.KeyVault/vaults/jps-aat" -> null
      - name                    = "judicial-payment-service-POSTGRES-HOST-V15" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/jps-shared-aat/providers/Microsoft.KeyVault/vaults/jps-aat/secrets/judicial-payment-service-POSTGRES-HOST-V15/versions/2e80a97aa89f409b8084fc24d5a3da7e" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/jps-shared-aat/providers/Microsoft.KeyVault/vaults/jps-aat/secrets/judicial-payment-service-POSTGRES-HOST-V15" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "2e80a97aa89f409b8084fc24d5a3da7e" -> null
      - versionless_id          = "https://jps-aat.vault.azure.net/secrets/judicial-payment-service-POSTGRES-HOST-V15" -> null
    }

  # azurerm_key_vault_secret.POSTGRES-PASS will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-PASS" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/jps-shared-aat/providers/Microsoft.KeyVault/vaults/jps-aat"
      + name                    = "judicial-payment-service-POSTGRES-PASS"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES-PASS-V15 will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES-PASS-V15 is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES-PASS-V15" {
      - id                      = "https://jps-aat.vault.azure.net/secrets/judicial-payment-service-POSTGRES-PASS-V15/0c34b07d038340a99cb71c59199c793a" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/jps-shared-aat/providers/Microsoft.KeyVault/vaults/jps-aat" -> null
      - name                    = "judicial-payment-service-POSTGRES-PASS-V15" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/jps-shared-aat/providers/Microsoft.KeyVault/vaults/jps-aat/secrets/judicial-payment-service-POSTGRES-PASS-V15/versions/0c34b07d038340a99cb71c59199c793a" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/jps-shared-aat/providers/Microsoft.KeyVault/vaults/jps-aat/secrets/judicial-payment-service-POSTGRES-PASS-V15" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "0c34b07d038340a99cb71c59199c793a" -> null
      - versionless_id          = "https://jps-aat.vault.azure.net/secrets/judicial-payment-service-POSTGRES-PASS-V15" -> null
    }

  # azurerm_key_vault_secret.POSTGRES-PORT will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-PORT" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/jps-shared-aat/providers/Microsoft.KeyVault/vaults/jps-aat"
      + name                    = "judicial-payment-service-POSTGRES-PORT"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES-USER will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-USER" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/jps-shared-aat/providers/Microsoft.KeyVault/vaults/jps-aat"
      + name                    = "judicial-payment-service-POSTGRES-USER"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES-USER-V15 will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES-USER-V15 is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES-USER-V15" {
      - id                      = "https://jps-aat.vault.azure.net/secrets/judicial-payment-service-POSTGRES-USER-V15/d11cc5e6b0c4490b9d4ca3752527f2db" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/jps-shared-aat/providers/Microsoft.KeyVault/vaults/jps-aat" -> null
      - name                    = "judicial-payment-service-POSTGRES-USER-V15" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/jps-shared-aat/providers/Microsoft.KeyVault/vaults/jps-aat/secrets/judicial-payment-service-POSTGRES-USER-V15/versions/d11cc5e6b0c4490b9d4ca3752527f2db" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/jps-shared-aat/providers/Microsoft.KeyVault/vaults/jps-aat/secrets/judicial-payment-service-POSTGRES-USER-V15" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "d11cc5e6b0c4490b9d4ca3752527f2db" -> null
      - versionless_id          = "https://jps-aat.vault.azure.net/secrets/judicial-payment-service-POSTGRES-USER-V15" -> null
    }

Plan: 5 to add, 0 to change, 3 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":130,"Program":"tfcmt","SHA1":"","Vars":{}} -->